MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J93/mcu.h
extern volatile CCPR1Lbits_t CCPR1Lbits __at(0xF69);
// bitfield macros
#define _CCPR1L_CCPR1L_POSN                                 0x0
#define _CCPR1L_CCPR1L_POSITION                             0x0
#define _CCPR1L_CCPR1L_SIZE                                 0x8
#define _CCPR1L_CCPR1L_LENGTH                               0x8
#define _CCPR1L_CCPR1L_MASK                                 0xFF

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0xF6A);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR1H                 :8;
    };
} CCPR1Hbits_t;
extern volatile CCPR1Hbits_t CCPR1Hbits __at(0xF6A);
// bitfield macros
#define _CCPR1H_CCPR1H_POSN                                 0x0
#define _CCPR1H_CCPR1H_POSITION                             0x0
#define _CCPR1H_CCPR1H_SIZE                                 0x8
#define _CCPR1H_CCPR1H_LENGTH                               0x8
#define _CCPR1H_CCPR1H_MASK                                 0xFF

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
extern volatile unsigned char           LCDDATA5            __at(0xF6B);
#ifndef _LIB_BUILD
asm("LCDDATA5 equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA5               :8;
    };
    struct {
        unsigned S40C0                  :1;
        unsigned S41C0                  :1;
        unsigned S42C0                  :1;
        unsigned S43C0                  :1;
        unsigned S44C0                  :1;
        unsigned S45C0                  :1;
        unsigned S46C0                  :1;
        unsigned S47C0                  :1;
    };
    struct {
        unsigned SEG40COM0              :1;
        unsigned SEG41COM0              :1;
        unsigned SEG42COM0              :1;
        unsigned SEG43COM0              :1;
        unsigned SEG44COM0              :1;
        unsigned SEG45COM0              :1;
        unsigned SEG46COM0              :1;
        unsigned SEG47COM0              :1;
    };
    struct {
        unsigned S40C15                 :1;
    };
} LCDDATA5bits_t;
extern volatile LCDDATA5bits_t LCDDATA5bits __at(0xF6B);
// bitfield macros
#define _LCDDATA5_LCDDATA5_POSN                             0x0
#define _LCDDATA5_LCDDATA5_POSITION                         0x0
#define _LCDDATA5_LCDDATA5_SIZE                             0x8
#define _LCDDATA5_LCDDATA5_LENGTH                           0x8
#define _LCDDATA5_LCDDATA5_MASK                             0xFF
#define _LCDDATA5_S40C0_POSN                                0x0
#define _LCDDATA5_S40C0_POSITION                            0x0
#define _LCDDATA5_S40C0_SIZE                                0x1
#define _LCDDATA5_S40C0_LENGTH                              0x1
#define _LCDDATA5_S40C0_MASK                                0x1
#define _LCDDATA5_S41C0_POSN                                0x1
#define _LCDDATA5_S41C0_POSITION                            0x1
#define _LCDDATA5_S41C0_SIZE                                0x1
#define _LCDDATA5_S41C0_LENGTH                              0x1
#define _LCDDATA5_S41C0_MASK                                0x2
#define _LCDDATA5_S42C0_POSN                                0x2
#define _LCDDATA5_S42C0_POSITION                            0x2
#define _LCDDATA5_S42C0_SIZE                                0x1
#define _LCDDATA5_S42C0_LENGTH                              0x1
#define _LCDDATA5_S42C0_MASK                                0x4
#define _LCDDATA5_S43C0_POSN                                0x3
#define _LCDDATA5_S43C0_POSITION                            0x3
#define _LCDDATA5_S43C0_SIZE                                0x1
#define _LCDDATA5_S43C0_LENGTH                              0x1
#define _LCDDATA5_S43C0_MASK                                0x8
#define _LCDDATA5_S44C0_POSN                                0x4
#define _LCDDATA5_S44C0_POSITION                            0x4
#define _LCDDATA5_S44C0_SIZE                                0x1
#define _LCDDATA5_S44C0_LENGTH                              0x1
#define _LCDDATA5_S44C0_MASK                                0x10
#define _LCDDATA5_S45C0_POSN                                0x5
#define _LCDDATA5_S45C0_POSITION                            0x5
#define _LCDDATA5_S45C0_SIZE                                0x1
#define _LCDDATA5_S45C0_LENGTH                              0x1
#define _LCDDATA5_S45C0_MASK                                0x20
#define _LCDDATA5_S46C0_POSN                                0x6
#define _LCDDATA5_S46C0_POSITION                            0x6
#define _LCDDATA5_S46C0_SIZE                                0x1
#define _LCDDATA5_S46C0_LENGTH                              0x1
#define _LCDDATA5_S46C0_MASK                                0x40
#define _LCDDATA5_S47C0_POSN                                0x7
#define _LCDDATA5_S47C0_POSITION                            0x7
#define _LCDDATA5_S47C0_SIZE                                0x1
#define _LCDDATA5_S47C0_LENGTH                              0x1
#define _LCDDATA5_S47C0_MASK                                0x80
#define _LCDDATA5_SEG40COM0_POSN                            0x0
#define _LCDDATA5_SEG40COM0_POSITION                        0x0
#define _LCDDATA5_SEG40COM0_SIZE                            0x1
#define _LCDDATA5_SEG40COM0_LENGTH                          0x1
#define _LCDDATA5_SEG40COM0_MASK                            0x1
#define _LCDDATA5_SEG41COM0_POSN                            0x1
#define _LCDDATA5_SEG41COM0_POSITION                        0x1
#define _LCDDATA5_SEG41COM0_SIZE                            0x1
#define _LCDDATA5_SEG41COM0_LENGTH                          0x1
#define _LCDDATA5_SEG41COM0_MASK                            0x2
#define _LCDDATA5_SEG42COM0_POSN                            0x2
#define _LCDDATA5_SEG42COM0_POSITION                        0x2
#define _LCDDATA5_SEG42COM0_SIZE                            0x1
#define _LCDDATA5_SEG42COM0_LENGTH                          0x1
#define _LCDDATA5_SEG42COM0_MASK                            0x4
#define _LCDDATA5_SEG43COM0_POSN                            0x3
#define _LCDDATA5_SEG43COM0_POSITION                        0x3
#define _LCDDATA5_SEG43COM0_SIZE                            0x1
#define _LCDDATA5_SEG43COM0_LENGTH                          0x1
#define _LCDDATA5_SEG43COM0_MASK                            0x8
#define _LCDDATA5_SEG44COM0_POSN                            0x4
#define _LCDDATA5_SEG44COM0_POSITION                        0x4
#define _LCDDATA5_SEG44COM0_SIZE                            0x1
#define _LCDDATA5_SEG44COM0_LENGTH                          0x1
#define _LCDDATA5_SEG44COM0_MASK                            0x10
#define _LCDDATA5_SEG45COM0_POSN                            0x5
#define _LCDDATA5_SEG45COM0_POSITION                        0x5
#define _LCDDATA5_SEG45COM0_SIZE                            0x1
#define _LCDDATA5_SEG45COM0_LENGTH                          0x1
#define _LCDDATA5_SEG45COM0_MASK                            0x20
#define _LCDDATA5_SEG46COM0_POSN                            0x6
#define _LCDDATA5_SEG46COM0_POSITION                        0x6
#define _LCDDATA5_SEG46COM0_SIZE                            0x1
#define _LCDDATA5_SEG46COM0_LENGTH                          0x1
#define _LCDDATA5_SEG46COM0_MASK                            0x40
#define _LCDDATA5_SEG47COM0_POSN                            0x7
#define _LCDDATA5_SEG47COM0_POSITION                        0x7
#define _LCDDATA5_SEG47COM0_SIZE                            0x1
#define _LCDDATA5_SEG47COM0_LENGTH                          0x1
#define _LCDDATA5_SEG47COM0_MASK                            0x80
#define _LCDDATA5_S40C15_POSN                               0x0
#define _LCDDATA5_S40C15_POSITION                           0x0
#define _LCDDATA5_S40C15_SIZE                               0x1
#define _LCDDATA5_S40C15_LENGTH                             0x1
#define _LCDDATA5_S40C15_MASK                               0x1

