MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J93/mcu.h
extern volatile PORTHbits_t PORTHbits __at(0xF87);
// bitfield macros
#define _PORTH_RH0_POSN                                     0x0
#define _PORTH_RH0_POSITION                                 0x0
#define _PORTH_RH0_SIZE                                     0x1
#define _PORTH_RH0_LENGTH                                   0x1
#define _PORTH_RH0_MASK                                     0x1
#define _PORTH_RH1_POSN                                     0x1
#define _PORTH_RH1_POSITION                                 0x1
#define _PORTH_RH1_SIZE                                     0x1
#define _PORTH_RH1_LENGTH                                   0x1
#define _PORTH_RH1_MASK                                     0x2
#define _PORTH_RH2_POSN                                     0x2
#define _PORTH_RH2_POSITION                                 0x2
#define _PORTH_RH2_SIZE                                     0x1
#define _PORTH_RH2_LENGTH                                   0x1
#define _PORTH_RH2_MASK                                     0x4
#define _PORTH_RH3_POSN                                     0x3
#define _PORTH_RH3_POSITION                                 0x3
#define _PORTH_RH3_SIZE                                     0x1
#define _PORTH_RH3_LENGTH                                   0x1
#define _PORTH_RH3_MASK                                     0x8
#define _PORTH_RH4_POSN                                     0x4
#define _PORTH_RH4_POSITION                                 0x4
#define _PORTH_RH4_SIZE                                     0x1
#define _PORTH_RH4_LENGTH                                   0x1
#define _PORTH_RH4_MASK                                     0x10
#define _PORTH_RH5_POSN                                     0x5
#define _PORTH_RH5_POSITION                                 0x5
#define _PORTH_RH5_SIZE                                     0x1
#define _PORTH_RH5_LENGTH                                   0x1
#define _PORTH_RH5_MASK                                     0x20
#define _PORTH_RH6_POSN                                     0x6
#define _PORTH_RH6_POSITION                                 0x6
#define _PORTH_RH6_SIZE                                     0x1
#define _PORTH_RH6_LENGTH                                   0x1
#define _PORTH_RH6_MASK                                     0x40
#define _PORTH_RH7_POSN                                     0x7
#define _PORTH_RH7_POSITION                                 0x7
#define _PORTH_RH7_SIZE                                     0x1
#define _PORTH_RH7_LENGTH                                   0x1
#define _PORTH_RH7_MASK                                     0x80
#define _PORTH_SEG47_POSN                                   0x0
#define _PORTH_SEG47_POSITION                               0x0
#define _PORTH_SEG47_SIZE                                   0x1
#define _PORTH_SEG47_LENGTH                                 0x1
#define _PORTH_SEG47_MASK                                   0x1
#define _PORTH_SEG46_POSN                                   0x1
#define _PORTH_SEG46_POSITION                               0x1
#define _PORTH_SEG46_SIZE                                   0x1
#define _PORTH_SEG46_LENGTH                                 0x1
#define _PORTH_SEG46_MASK                                   0x2
#define _PORTH_SEG45_POSN                                   0x2
#define _PORTH_SEG45_POSITION                               0x2
#define _PORTH_SEG45_SIZE                                   0x1
#define _PORTH_SEG45_LENGTH                                 0x1
#define _PORTH_SEG45_MASK                                   0x4
#define _PORTH_SEG44_POSN                                   0x3
#define _PORTH_SEG44_POSITION                               0x3
#define _PORTH_SEG44_SIZE                                   0x1
#define _PORTH_SEG44_LENGTH                                 0x1
#define _PORTH_SEG44_MASK                                   0x8
#define _PORTH_SEG40_POSN                                   0x4
#define _PORTH_SEG40_POSITION                               0x4
#define _PORTH_SEG40_SIZE                                   0x1
#define _PORTH_SEG40_LENGTH                                 0x1
#define _PORTH_SEG40_MASK                                   0x10
#define _PORTH_SEG41_POSN                                   0x5
#define _PORTH_SEG41_POSITION                               0x5
#define _PORTH_SEG41_SIZE                                   0x1
#define _PORTH_SEG41_LENGTH                                 0x1
#define _PORTH_SEG41_MASK                                   0x20
#define _PORTH_SEG42_POSN                                   0x6
#define _PORTH_SEG42_POSITION                               0x6
#define _PORTH_SEG42_SIZE                                   0x1
#define _PORTH_SEG42_LENGTH                                 0x1
#define _PORTH_SEG42_MASK                                   0x40
#define _PORTH_SEG43_POSN                                   0x7
#define _PORTH_SEG43_POSITION                               0x7
#define _PORTH_SEG43_SIZE                                   0x1
#define _PORTH_SEG43_LENGTH                                 0x1
#define _PORTH_SEG43_MASK                                   0x80
#define _PORTH_CCP9_POSN                                    0x4
#define _PORTH_CCP9_POSITION                                0x4
#define _PORTH_CCP9_SIZE                                    0x1
#define _PORTH_CCP9_LENGTH                                  0x1
#define _PORTH_CCP9_MASK                                    0x10
#define _PORTH_CCP8_POSN                                    0x5
#define _PORTH_CCP8_POSITION                                0x5
#define _PORTH_CCP8_SIZE                                    0x1
#define _PORTH_CCP8_LENGTH                                  0x1
#define _PORTH_CCP8_MASK                                    0x20
#define _PORTH_CCP7_POSN                                    0x6
#define _PORTH_CCP7_POSITION                                0x6
#define _PORTH_CCP7_SIZE                                    0x1
#define _PORTH_CCP7_LENGTH                                  0x1
#define _PORTH_CCP7_MASK                                    0x40
#define _PORTH_CCP6_POSN                                    0x7
#define _PORTH_CCP6_POSITION                                0x7
#define _PORTH_CCP6_SIZE                                    0x1
#define _PORTH_CCP6_LENGTH                                  0x1
#define _PORTH_CCP6_MASK                                    0x80
#define _PORTH_PC3_POSN                                     0x4
#define _PORTH_PC3_POSITION                                 0x4
#define _PORTH_PC3_SIZE                                     0x1
#define _PORTH_PC3_LENGTH                                   0x1
#define _PORTH_PC3_MASK                                     0x10
#define _PORTH_PB3_POSN                                     0x5
#define _PORTH_PB3_POSITION                                 0x5
#define _PORTH_PB3_SIZE                                     0x1
#define _PORTH_PB3_LENGTH                                   0x1
#define _PORTH_PB3_MASK                                     0x20
#define _PORTH_PC1_POSN                                     0x6
#define _PORTH_PC1_POSITION                                 0x6
#define _PORTH_PC1_SIZE                                     0x1
#define _PORTH_PC1_LENGTH                                   0x1
#define _PORTH_PC1_MASK                                     0x40
#define _PORTH_PB1_POSN                                     0x7
#define _PORTH_PB1_POSITION                                 0x7
#define _PORTH_PB1_SIZE                                     0x1
#define _PORTH_PB1_LENGTH                                   0x1
#define _PORTH_PB1_MASK                                     0x80

// Register: PORTJ
#define PORTJ PORTJ
extern volatile unsigned char           PORTJ               __at(0xF88);
#ifndef _LIB_BUILD
asm("PORTJ equ 0F88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RJ0                    :1;
        unsigned RJ1                    :1;
        unsigned RJ2                    :1;
        unsigned RJ3                    :1;
        unsigned RJ4                    :1;
        unsigned RJ5                    :1;
        unsigned RJ6                    :1;
        unsigned RJ7                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned SEG33                  :1;
        unsigned SEG34                  :1;
        unsigned SEG35                  :1;
        unsigned SEG39                  :1;
        unsigned SEG38                  :1;
        unsigned SEG37                  :1;
        unsigned SEG36                  :1;
    };
} PORTJbits_t;
extern volatile PORTJbits_t PORTJbits __at(0xF88);
// bitfield macros
#define _PORTJ_RJ0_POSN                                     0x0
#define _PORTJ_RJ0_POSITION                                 0x0
#define _PORTJ_RJ0_SIZE                                     0x1
#define _PORTJ_RJ0_LENGTH                                   0x1
#define _PORTJ_RJ0_MASK                                     0x1
#define _PORTJ_RJ1_POSN                                     0x1
#define _PORTJ_RJ1_POSITION                                 0x1
#define _PORTJ_RJ1_SIZE                                     0x1
#define _PORTJ_RJ1_LENGTH                                   0x1
#define _PORTJ_RJ1_MASK                                     0x2
#define _PORTJ_RJ2_POSN                                     0x2
#define _PORTJ_RJ2_POSITION                                 0x2
#define _PORTJ_RJ2_SIZE                                     0x1
#define _PORTJ_RJ2_LENGTH                                   0x1
#define _PORTJ_RJ2_MASK                                     0x4
#define _PORTJ_RJ3_POSN                                     0x3
#define _PORTJ_RJ3_POSITION                                 0x3
#define _PORTJ_RJ3_SIZE                                     0x1
#define _PORTJ_RJ3_LENGTH                                   0x1
#define _PORTJ_RJ3_MASK                                     0x8
#define _PORTJ_RJ4_POSN                                     0x4
#define _PORTJ_RJ4_POSITION                                 0x4
#define _PORTJ_RJ4_SIZE                                     0x1
#define _PORTJ_RJ4_LENGTH                                   0x1
#define _PORTJ_RJ4_MASK                                     0x10
#define _PORTJ_RJ5_POSN                                     0x5
#define _PORTJ_RJ5_POSITION                                 0x5
#define _PORTJ_RJ5_SIZE                                     0x1
#define _PORTJ_RJ5_LENGTH                                   0x1
#define _PORTJ_RJ5_MASK                                     0x20
#define _PORTJ_RJ6_POSN                                     0x6
#define _PORTJ_RJ6_POSITION                                 0x6
#define _PORTJ_RJ6_SIZE                                     0x1
#define _PORTJ_RJ6_LENGTH                                   0x1
#define _PORTJ_RJ6_MASK                                     0x40
#define _PORTJ_RJ7_POSN                                     0x7
#define _PORTJ_RJ7_POSITION                                 0x7
#define _PORTJ_RJ7_SIZE                                     0x1
#define _PORTJ_RJ7_LENGTH                                   0x1
#define _PORTJ_RJ7_MASK                                     0x80
#define _PORTJ_SEG33_POSN                                   0x1
#define _PORTJ_SEG33_POSITION                               0x1
#define _PORTJ_SEG33_SIZE                                   0x1
#define _PORTJ_SEG33_LENGTH                                 0x1
#define _PORTJ_SEG33_MASK                                   0x2
#define _PORTJ_SEG34_POSN                                   0x2
#define _PORTJ_SEG34_POSITION                               0x2
#define _PORTJ_SEG34_SIZE                                   0x1
#define _PORTJ_SEG34_LENGTH                                 0x1
#define _PORTJ_SEG34_MASK                                   0x4
#define _PORTJ_SEG35_POSN                                   0x3
#define _PORTJ_SEG35_POSITION                               0x3
#define _PORTJ_SEG35_SIZE                                   0x1
#define _PORTJ_SEG35_LENGTH                                 0x1
#define _PORTJ_SEG35_MASK                                   0x8
#define _PORTJ_SEG39_POSN                                   0x4
#define _PORTJ_SEG39_POSITION                               0x4
#define _PORTJ_SEG39_SIZE                                   0x1
#define _PORTJ_SEG39_LENGTH                                 0x1
#define _PORTJ_SEG39_MASK                                   0x10
#define _PORTJ_SEG38_POSN                                   0x5
#define _PORTJ_SEG38_POSITION                               0x5
#define _PORTJ_SEG38_SIZE                                   0x1
#define _PORTJ_SEG38_LENGTH                                 0x1
#define _PORTJ_SEG38_MASK                                   0x20
#define _PORTJ_SEG37_POSN                                   0x6
#define _PORTJ_SEG37_POSITION                               0x6
#define _PORTJ_SEG37_SIZE                                   0x1
#define _PORTJ_SEG37_LENGTH                                 0x1
#define _PORTJ_SEG37_MASK                                   0x40
#define _PORTJ_SEG36_POSN                                   0x7
#define _PORTJ_SEG36_POSITION                               0x7
#define _PORTJ_SEG36_SIZE                                   0x1
#define _PORTJ_SEG36_LENGTH                                 0x1
#define _PORTJ_SEG36_MASK                                   0x80

